tutorials/blastFoam/movingCone/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   movingAdaptiveFvMesh;
errorEstimator densityGradient;

motionSolver    velocityComponentLaplacian;

component       x;
diffusivity     directional (1 200 0);

// How often to refine
refineInterval  5;

// Refine field in between lower..upper (varies based on errorEstimator)
lowerRefineLevel 0.01;

// If value < unrefineLevel unrefine
unrefineLevel   0.01;

// Number of cells refined around high error cells
nBufferLayers   1;

// Refine cells only up to maxRefinement levels
maxRefinement  4;

// Write the refinement level as a volScalarField
dumpLevel       true;
// ************************************************************************* //
