tutorials/blastFoam/movingCone/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mixture
{
    type basic;
    calculateDensity yes;

    thermoType
    {
        transport       const;
        thermo          hConst;
        equationOfState idealGas;
    }
    equationOfState
    {
        gamma       1.4;
    }

    specie
    {
        molWeight   28.9;
    }
    thermodynamics
    {
        Cp          1007;
        Hf          2.544e+06;
    }
    transport
    {
        mu          1e-3;
        Pr          0.7;
    }
}


// ************************************************************************* //
